In [1]:
%load_ext sql

In [2]:
%sql ibm_db_sa://mpc82210:7rf3d7vvlfj%5Egf7d@dashdb-txn-sbox-yp-dal09-10.services.dal.bluemix.net:50000/BLUDB

In [37]:
%sql SELECT * FROM DEPARTMENTS

 * ibm_db_sa://mpc82210:***@dashdb-txn-sbox-yp-dal09-10.services.dal.bluemix.net:50000/BLUDB
Done.

[('2        ', 'Architect Group', '30001    ', 'L0001    '),
 ('5        ', 'Software Group', '30002    ', 'L0002    '),
 ('7        ', 'Design Team', '30003    ', 'L0003    ')]

In [38]:
%sql SELECT * FROM EMPLOYEES

 * ibm_db_sa://mpc82210:***@dashdb-txn-sbox-yp-dal09-10.services.dal.bluemix.net:50000/BLUDB
Done.

[('E1001    ', 'John', 'Thomas', '123456   ', datetime.date(1976, 1, 9), 'M', '5631 Rice, OakPark,IL', '100      ', Decimal('100000.00'), '30001    ', '2        '),
 ('E1002    ', 'Alice', 'James', '123457   ', datetime.date(1972, 7, 31), 'F', '980 Berry ln, Elgin,IL', '200      ', Decimal('80000.00'), '30002    ', '5        '),
 ('E1003    ', 'Steve', 'Wells', '123458   ', datetime.date(1980, 8, 10), 'M', '291 Springs, Gary,IL', '300      ', Decimal('50000.00'), '30002    ', '5        '),
 ('E1004    ', 'Santosh', 'Kumar', '123459   ', datetime.date(1985, 7, 20), 'M', '511 Aurora Av, Aurora,IL', '400      ', Decimal('60000.00'), '30004    ', '5        '),
 ('E1005    ', 'Ahmed', 'Hussain', '123410   ', datetime.date(1981, 1, 4), 'M', '216 Oak Tree, Geneva,IL', '500      ', Decimal('70000.00'), '30001    ', '2        '),
 ('E1006    ', 'Nancy', 'Allen', '123411   ', datetime.date(1978, 2, 6), 'F', '111 Green Pl, Elgin,IL', '600      ', Decimal('90000.00'), '30001    ', '2        '),
 ('E1007    ', 'Mary', 'Thomas', '123412   ', datetime.date(1975, 5, 5), 'F', '100 Rose Pl, Gary,IL', '650      ', Decimal('65000.00'), '30003    ', '7        '),
 ('E1008    ', 'Bharath', 'Gupta', '123413   ', datetime.date(1985, 5, 6), 'M', '145 Berry Ln, Naperville,IL', '660      ', Decimal('65000.00'), '30003    ', '7        '),
 ('E1009    ', 'Andrea', 'Jones', '123414   ', datetime.date(1990, 7, 9), 'F', '120 Fall Creek, Gary,IL', '234      ', Decimal('70000.00'), '30003    ', '7        '),
 ('E1010    ', 'Ann', 'Jacob', '123415   ', datetime.date(1982, 3, 30), 'F', '111 Britany Springs,Elgin,IL', '220      ', Decimal('70000.00'), '30004    ', '5        ')]

In [6]:
#%sql SELECT f_name, l_name, dep_id FROM EMPLOYEES ORDER BY dep_id DESC, l_name DESC

In [19]:
#%sql SELECT dep_id, COUNT(*) FROM EMPLOYEES GROUP BY dep_id

In [30]:
#%sql SELECT * FROM EMPLOYEES GROUP BY dep_id

In [36]:
%sql SELECT COUNT(f_name) AS NUM_EMP, AVG(SALARY) AS AVG_SALARY, DEP_ID FROM EMPLOYEES GROUP BY dep_id HAVING COUNT(f_name)<4 ORDER BY AVG_SALARY

 * ibm_db_sa://mpc82210:***@dashdb-txn-sbox-yp-dal09-10.services.dal.bluemix.net:50000/BLUDB
Done.

[(Decimal('3'), Decimal('66666.66666666666666666666666'), '7        '),
 (Decimal('3'), Decimal('86666.66666666666666666666666'), '2        ')]

In [43]:
%sql  SELECT E.F_NAME, E.L_NAME, D.DEPT_ID_DEP, E.DEP_ID, D.DEP_NAME FROM EMPLOYEES AS E, DEPARTMENTS AS D WHERE E.DEP_ID = D.DEPT_ID_DEP

 * ibm_db_sa://mpc82210:***@dashdb-txn-sbox-yp-dal09-10.services.dal.bluemix.net:50000/BLUDB
Done.

[('John', 'Thomas', '2        ', '2        ', 'Architect Group'),
 ('Alice', 'James', '5        ', '5        ', 'Software Group'),
 ('Steve', 'Wells', '5        ', '5        ', 'Software Group'),
 ('Santosh', 'Kumar', '5        ', '5        ', 'Software Group'),
 ('Ahmed', 'Hussain', '2        ', '2        ', 'Architect Group'),
 ('Nancy', 'Allen', '2        ', '2        ', 'Architect Group'),
 ('Mary', 'Thomas', '7        ', '7        ', 'Design Team'),
 ('Bharath', 'Gupta', '7        ', '7        ', 'Design Team'),
 ('Andrea', 'Jones', '7        ', '7        ', 'Design Team'),
 ('Ann', 'Jacob', '5        ', '5        ', 'Software Group')]